src/cf/src/InformationRegisters/ВерсииПодсистем/ВерсииПодсистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииПодсистем</name>
  <comment>Версия данных информационной базы по каждой подсистеме (механизм ОбновлениеПрограммы)</comment>
  <resources>
    <name>Версия</name>
    <comment>Версия данных информационной базы в формате 1.0.12.1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИмяПодсистемы</name>
    <comment>Имя подсистемы; для самой конфигурации - maERP</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/CommonModules/ОбновлениеПрограммы/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Ядро механизма обновления информационной базы.
//
// Версия данных базы хранится в регистре ВерсииПодсистем (измерение
// ИмяПодсистемы, для самой конфигурации - "maERP"). При входе первого сеанса
// версия базы сравнивается с версией конфигурации; недостающие обработчики
// обновления выполняются по возрастанию версий, каждый протоколируется в
// журнале регистрации. Список обработчиков задаётся в модуле
// ОбновлениеПрограммыОбработчики.
//
// Версию базы и отметку о показе описания изменений механизм читает и пишет под
// любым пользователем, поэтому работает с ними в привилегированном режиме.
// BSLLS:SetPrivilegedMode-off
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Имя подсистемы, под которым версия самой конфигурации хранится в регистре ВерсииПодсистем.
//
// Возвращаемое значение:
//  Строка - имя подсистемы
//
Функция ИмяПодсистемыКонфигурации() Экспорт

	Возврат "maERP";

КонецФункции

// Версия конфигурации из свойств метаданных.
//
// Возвращаемое значение:
//  Строка - версия вида "1.0.12.1"
//
Функция ВерсияКонфигурации() Экспорт

	Возврат Метаданные.Версия;

КонецФункции

// Версия данных информационной базы.
// Если в регистре записи ещё нет, версия определяется по данным базы
// (см. ОбновлениеПрограммыОбработчики.СтартоваяВерсияИнформационнойБазы).
//
// Возвращаемое значение:
//  Строка - версия вида "1.0.12.1"; пустая строка для новой (пустой) базы
//
Функция ВерсияИнформационнойБазы() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Отбор = Новый Структура("ИмяПодсистемы", ИмяПодсистемыКонфигурации());
	Ресурсы = РегистрыСведений.ВерсииПодсистем.Получить(Отбор);
	Если ЗначениеЗаполнено(Ресурсы.Версия) Тогда
		Возврат Ресурсы.Версия;
	КонецЕсли;

	Возврат ОбновлениеПрограммыОбработчики.СтартоваяВерсияИнформационнойБазы();

КонецФункции

// Записывает версию данных информационной базы.
//
// Параметры:
//  Версия - Строка - версия вида "1.0.12.1"
//
Процедура УстановитьВерсиюИнформационнойБазы(Версия) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ВерсииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПодсистемы = ИмяПодсистемыКонфигурации();
	МенеджерЗаписи.Версия = Версия;
	МенеджерЗаписи.Записать();

КонецПроцедуры

// Требуется ли обновление данных информационной базы.
//
// Возвращаемое значение:
//  Булево - Истина, если версия базы меньше версии конфигурации
//
Функция ТребуетсяОбновление() Экспорт

	Возврат СравнитьВерсии(ВерсияИнформационнойБазы(), ВерсияКонфигурации()) < 0;

КонецФункции

// Выполняет обработчики обновления от версии базы до версии конфигурации.
// Монопольный режим захватывается, если среди выполняемых обработчиков есть монопольные.
//
// Возвращаемое значение:
//  Структура - результат обновления:
//   * Выполнено             - Булево - обновление завершено, версия базы поднята
//   * ВерсияДо              - Строка - версия базы до обновления
//   * ВерсияПосле           - Строка - версия базы после обновления
//   * ВыполненоОбработчиков - Число  - количество успешно выполненных обработчиков
//   * ОписаниеОшибки        - Строка - причина, по которой обновление не выполнено
//
Функция ВыполнитьОбновление() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("ВерсияДо", "");
	Результат.Вставить("ВерсияПосле", "");
	Результат.Вставить("ВыполненоОбработчиков", 0);
	Результат.Вставить("ОписаниеОшибки", "");

	УстановитьПривилегированныйРежим(Истина);

	ВерсияБазы = ВерсияИнформационнойБазы();
	ВерсияПрограммы = ВерсияКонфигурации();
	Результат.ВерсияДо = ВерсияБазы;
	Результат.ВерсияПосле = ВерсияБазы;

	Если СравнитьВерсии(ВерсияБазы, ВерсияПрограммы) >= 0 Тогда
		Результат.Выполнено = Истина;
		Возврат Результат;
	КонецЕсли;

	Выполняемые = ВыполняемыеОбработчики(ВерсияБазы, ВерсияПрограммы);

	МонопольныйРежимУстановлен = Ложь;
	Если ТребуетсяМонопольныйРежим(Выполняемые) И Не МонопольныйРежим() Тогда
		Попытка
			УстановитьМонопольныйРежим(Истина);
			МонопольныйРежимУстановлен = Истина;
		Исключение
			Результат.ОписаниеОшибки = НСтр("ru = 'Обновление требует монопольного режима: в базе работают другие пользователи.';
				|fr = 'La mise à jour nécessite le mode exclusif : d''autres utilisateurs travaillent dans la base.';
				|en = 'The update requires the exclusive mode: other users are working in the infobase.';
				|es = 'La actualización requiere el modo exclusivo: otros usuarios trabajan en la base.'");
			ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Предупреждение, Результат.ОписаниеОшибки);
			Возврат Результат;
		КонецПопытки;
	КонецЕсли;

	Попытка
		ВыполнитьОбработчики(Выполняемые, Результат);
		УстановитьВерсиюИнформационнойБазы(ВерсияПрограммы);
		Результат.Выполнено = Истина;
		Результат.ВерсияПосле = ВерсияПрограммы;

		ШаблонИтога = НСтр("ru = 'Обновление с версии %1 на версию %2 завершено, выполнено обработчиков: %3';
			|fr = 'La mise à jour de la version %1 vers la version %2 est terminée, gestionnaires exécutés : %3';
			|en = 'Update from version %1 to version %2 is completed, handlers executed: %3';
			|es = 'La actualización de la versión %1 a la versión %2 está terminada, controladores ejecutados: %3'");
		ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Информация,
			СтрШаблон(ШаблонИтога, ВерсияПредставление(ВерсияБазы), ВерсияПрограммы, Результат.ВыполненоОбработчиков));
	Исключение
		// МенеджерОбработкиОшибок в 8.5.1 отсутствует, замены устаревшему методу нет.
		// BSLLS:DeprecatedMethodCall-off
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		// BSLLS:DeprecatedMethodCall-on
		ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, Результат.ОписаниеОшибки);
	КонецПопытки;

	Если МонопольныйРежимУстановлен Тогда
		УстановитьМонопольныйРежим(Ложь);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Сравнивает две версии вида "1.0.12.1" покомпонентно.
// Отсутствующие компоненты считаются нулями, пустая строка меньше любой версии.
//
// Параметры:
//  Версия1 - Строка - первая версия
//  Версия2 - Строка - вторая версия
//
// Возвращаемое значение:
//  Число - -1, если Версия1 меньше Версия2; 1, если больше; 0, если версии равны
//
Функция СравнитьВерсии(Версия1, Версия2) Экспорт

	Компоненты1 = СтрРазделить(СокрЛП(Версия1), ".", Ложь);
	Компоненты2 = СтрРазделить(СокрЛП(Версия2), ".", Ложь);

	КоличествоКомпонент = Макс(Компоненты1.Количество(), Компоненты2.Количество());
	Для Индекс = 1 По КоличествоКомпонент Цикл
		Значение1 = ?(Индекс <= Компоненты1.Количество(), ЧислоКомпоненты(Компоненты1[Индекс - 1]), 0);
		Значение2 = ?(Индекс <= Компоненты2.Количество(), ЧислоКомпоненты(Компоненты2[Индекс - 1]), 0);
		Если Значение1 < Значение2 Тогда
			Возврат -1;
		КонецЕсли;
		Если Значение1 > Значение2 Тогда
			Возврат 1;
		КонецЕсли;
	КонецЦикла;

	Возврат 0;

КонецФункции

// Создаёт пустую таблицу обработчиков обновления.
// Заполняется в ОбновлениеПрограммыОбработчики.ПриДобавленииОбработчиковОбновления.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки:
//   * Версия              - Строка - версия конфигурации, в которой появился обработчик
//   * Процедура           - Строка - полное имя процедуры вида "Модуль.Процедура"
//   * РежимВыполнения     - Строка - "Монопольно" или "Оперативно"
//   * НачальноеЗаполнение - Булево - обработчик выполняется только в новой (пустой) базе
//   * Комментарий         - Строка - назначение обработчика для журнала регистрации
//
Функция НоваяТаблицаОбработчиков() Экспорт

	ТипСтрока = Новый ОписаниеТипов("Строка");

	Обработчики = Новый ТаблицаЗначений;
	Обработчики.Колонки.Добавить("Версия", ТипСтрока);
	Обработчики.Колонки.Добавить("Процедура", ТипСтрока);
	Обработчики.Колонки.Добавить("РежимВыполнения", ТипСтрока);
	Обработчики.Колонки.Добавить("НачальноеЗаполнение", Новый ОписаниеТипов("Булево"));
	Обработчики.Колонки.Добавить("Комментарий", ТипСтрока);
	Возврат Обработчики;

КонецФункции

// Имя события журнала регистрации механизма обновления.
//
// Возвращаемое значение:
//  Строка - имя события
//
Функция ИмяСобытияЖурнала() Экспорт

	Возврат НСтр("ru = 'Обновление программы'; fr = 'Mise à jour du programme'; en = 'Application update';
		|es = 'Actualización del programa'");

КонецФункции

// Описание изменений по версиям из общего макета ОписаниеИзменений.
//
// Параметры:
//  ВерсияОт - Строка - включаются только версии больше указанной; пустая строка - без ограничения
//  ВерсияДо - Строка - включаются только версии не больше указанной; пустая строка - без ограничения
//
// Возвращаемое значение:
//  Массив из Структура - секции в порядке их следования в макете (от новых версий к старым):
//   * Версия    - Строка           - номер версии
//   * Изменения - Массив из Строка - пункты изменений
//
Функция ОписаниеИзменений(ВерсияОт = "", ВерсияДо = "") Экспорт

	ПрефиксВерсии = "## ";
	ПрефиксПункта = "- ";

	Секции = Новый Массив;
	Текущая = Неопределено;

	Текст = ПолучитьОбщийМакет("ОписаниеИзменений").ПолучитьТекст();
	Для Каждого Строка Из СтрРазделить(Текст, Символы.ПС, Истина) Цикл
		Строка = СокрЛП(Строка);
		Если СтрНачинаетсяС(Строка, ПрефиксВерсии) Тогда
			Текущая = НоваяСекцияОписанияИзменений(СокрЛП(Сред(Строка, СтрДлина(ПрефиксВерсии) + 1)));
			Секции.Добавить(Текущая);
		ИначеЕсли СтрНачинаетсяС(Строка, ПрефиксПункта) И Текущая <> Неопределено Тогда
			Текущая.Изменения.Добавить(СокрЛП(Сред(Строка, СтрДлина(ПрефиксПункта) + 1)));
		Иначе
			// Прочие строки макета - пояснения формата, в описание изменений не попадают.
			Продолжить;
		КонецЕсли;
	КонецЦикла;

	Отобранные = Новый Массив;
	Для Каждого Секция Из Секции Цикл
		Если ЗначениеЗаполнено(ВерсияОт) И СравнитьВерсии(Секция.Версия, ВерсияОт) <= 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВерсияДо) И СравнитьВерсии(Секция.Версия, ВерсияДо) > 0 Тогда
			Продолжить;
		КонецЕсли;
		Отобранные.Добавить(Секция);
	КонецЦикла;

	Возврат Отобранные;

КонецФункции

// Описание изменений одной версии - источник данных для выгрузки в хаб (scripts/changelog.sh).
//
// Параметры:
//  Версия - Строка - номер версии; пустая строка - версия конфигурации
//
// Возвращаемое значение:
//  Структура - Версия (Строка), Изменения (Массив из Строка); пустые изменения, если секции нет
//
Функция ОписаниеИзмененийВерсии(Версия = "") Экспорт

	НомерВерсии = ?(ЗначениеЗаполнено(Версия), Версия, ВерсияКонфигурации());
	Для Каждого Секция Из ОписаниеИзменений() Цикл
		Если СравнитьВерсии(Секция.Версия, НомерВерсии) = 0 Тогда
			Возврат Секция;
		КонецЕсли;
	КонецЦикла;

	Возврат НоваяСекцияОписанияИзменений(НомерВерсии);

КонецФункции

// Нужно ли показать пользователю окно "Что нового".
//
// Возвращаемое значение:
//  Структура - Показать (Булево), ВерсияОт (Строка) - версия, начиная с которой описание не показывалось
//
Функция ПоказыватьОписаниеИзменений() Экспорт

	Результат = Новый Структура("Показать, ВерсияОт", Ложь, "");

	ВерсияПоказанного = ВерсияПоказанногоОписанияИзменений();
	Если СравнитьВерсии(ВерсияПоказанного, ВерсияКонфигурации()) >= 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Результат.ВерсияОт = ВерсияПоказанного;
	Результат.Показать = ОписаниеИзменений(ВерсияПоказанного, ВерсияКонфигурации()).Количество() > 0;
	Возврат Результат;

КонецФункции

// Версия, до которой описание изменений уже показано текущему пользователю.
//
// Возвращаемое значение:
//  Строка - версия; пустая строка, если описание не показывалось
//
Функция ВерсияПоказанногоОписанияИзменений() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Значение = ХранилищеОбщихНастроек.Загрузить("ОбновлениеПрограммы", "ПоказанноеОписаниеИзменений", , , ИмяПользователя());
	Возврат ?(ТипЗнч(Значение) = Тип("Строка"), Значение, "");

КонецФункции

// Запоминает, что описание изменений показано текущему пользователю до указанной версии.
//
// Параметры:
//  Версия - Строка - версия; пустая строка - версия конфигурации
//
Процедура ЗапомнитьПоказанноеОписаниеИзменений(Версия = "") Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НомерВерсии = ?(ЗначениеЗаполнено(Версия), Версия, ВерсияКонфигурации());
	ХранилищеОбщихНастроек.Сохранить("ОбновлениеПрограммы", "ПоказанноеОписаниеИзменений", НомерВерсии, , ИмяПользователя());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчики, которые нужно выполнить при переходе с версии базы на версию конфигурации,
// в порядке возрастания версий.
//
// Параметры:
//  ВерсияБазы      - Строка - версия данных информационной базы
//  ВерсияПрограммы - Строка - версия конфигурации
//
// Возвращаемое значение:
//  Массив из Структура - Версия, Процедура, РежимВыполнения, Комментарий
//
Функция ВыполняемыеОбработчики(ВерсияБазы, ВерсияПрограммы)

	Обработчики = НоваяТаблицаОбработчиков();
	ОбновлениеПрограммыОбработчики.ПриДобавленииОбработчиковОбновления(Обработчики);

	// В новой (пустой) базе выполняется только начальное заполнение: конвертировать в ней нечего.
	НачальноеЗаполнение = Не ЗначениеЗаполнено(ВерсияБазы);

	Выполняемые = Новый Массив;
	Для Каждого Обработчик Из Обработчики Цикл
		Если Обработчик.НачальноеЗаполнение <> НачальноеЗаполнение Тогда
			Продолжить;
		КонецЕсли;
		Если Не НачальноеЗаполнение
			И (СравнитьВерсии(Обработчик.Версия, ВерсияБазы) <= 0
				Или СравнитьВерсии(Обработчик.Версия, ВерсияПрограммы) > 0) Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеОбработчика = Новый Структура;
		ОписаниеОбработчика.Вставить("Версия", Обработчик.Версия);
		ОписаниеОбработчика.Вставить("Процедура", Обработчик.Процедура);
		ОписаниеОбработчика.Вставить("РежимВыполнения", Обработчик.РежимВыполнения);
		ОписаниеОбработчика.Вставить("Комментарий", Обработчик.Комментарий);
		Выполняемые.Добавить(ОписаниеОбработчика);
	КонецЦикла;

	Возврат ОтсортированныеПоВерсии(Выполняемые);

КонецФункции

// Упорядочивает обработчики по возрастанию версий, сохраняя порядок регистрации внутри версии.
//
// Параметры:
//  Обработчики - Массив из Структура - обработчики в порядке регистрации
//
// Возвращаемое значение:
//  Массив из Структура - обработчики по возрастанию версий
//
Функция ОтсортированныеПоВерсии(Обработчики)

	Упорядоченные = Новый Массив;
	Для Каждого Обработчик Из Обработчики Цикл
		Позиция = Упорядоченные.Количество();
		Пока Позиция > 0 И СравнитьВерсии(Упорядоченные[Позиция - 1].Версия, Обработчик.Версия) > 0 Цикл
			Позиция = Позиция - 1;
		КонецЦикла;
		Упорядоченные.Вставить(Позиция, Обработчик);
	КонецЦикла;

	Возврат Упорядоченные;

КонецФункции

// Выполняет обработчики по одному, поднимая версию базы после последнего обработчика каждой версии:
// упавший обработчик не мешает при следующем входе повторить только невыполненное.
//
// Параметры:
//  Выполняемые - Массив из Структура - обработчики из ВыполняемыеОбработчики
//  Результат   - Структура           - результат обновления, счётчик обработчиков увеличивается на месте
//
Процедура ВыполнитьОбработчики(Выполняемые, Результат)

	Для Индекс = 0 По Выполняемые.Количество() - 1 Цикл

		Обработчик = Выполняемые[Индекс];
		НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
		// Обработчики регистрируются разработчиком в ОбновлениеПрограммыОбработчики,
		// произвольный код извне сюда не попадает. BSLLS:ExecuteExternalCodeInCommonModule-off
		Выполнить(Обработчик.Процедура + "();");
		// BSLLS:ExecuteExternalCodeInCommonModule-on
		Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоВыполнения;

		Результат.ВыполненоОбработчиков = Результат.ВыполненоОбработчиков + 1;

		ШаблонСообщения = НСтр("ru = 'Обработчик %1 (версия %2) выполнен за %3 мс. %4';
			|fr = 'Le gestionnaire %1 (version %2) est exécuté en %3 ms. %4';
			|en = 'Handler %1 (version %2) is executed in %3 ms. %4';
			|es = 'El controlador %1 (versión %2) se ejecutó en %3 ms. %4'");
		ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Информация,
			СтрШаблон(ШаблонСообщения, Обработчик.Процедура, Обработчик.Версия, Длительность, Обработчик.Комментарий));

		ПоследнийВВерсии = Индекс = Выполняемые.Количество() - 1
			Или СравнитьВерсии(Выполняемые[Индекс + 1].Версия, Обработчик.Версия) > 0;
		Если ПоследнийВВерсии Тогда
			УстановитьВерсиюИнформационнойБазы(Обработчик.Версия);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Есть ли среди обработчиков монопольные.
//
// Параметры:
//  Выполняемые - Массив из Структура - обработчики из ВыполняемыеОбработчики
//
// Возвращаемое значение:
//  Булево - Истина, если требуется монопольный режим
//
Функция ТребуетсяМонопольныйРежим(Выполняемые)

	Для Каждого Обработчик Из Выполняемые Цикл
		Если Обработчик.РежимВыполнения = "Монопольно" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Создаёт пустую секцию описания изменений.
//
// Параметры:
//  Версия - Строка - номер версии секции
//
// Возвращаемое значение:
//  Структура - Версия (Строка), Изменения (Массив из Строка)
//
Функция НоваяСекцияОписанияИзменений(Версия)

	Секция = Новый Структура;
	Секция.Вставить("Версия", Версия);
	Секция.Вставить("Изменения", Новый Массив);
	Возврат Секция;

КонецФункции

// Числовое значение компонента версии; нечисловые компоненты считаются нулями.
//
// Параметры:
//  Компонента - Строка - компонент версии
//
// Возвращаемое значение:
//  Число - значение компонента
//
Функция ЧислоКомпоненты(Компонента)

	Значение = СокрЛП(Компонента);
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат 0;
	КонецЕсли;

	Остаток = Значение;
	Для Каждого Цифра Из СтрРазделить("0,1,2,3,4,5,6,7,8,9", ",") Цикл
		Остаток = СтрЗаменить(Остаток, Цифра, "");
	КонецЦикла;
	Если ЗначениеЗаполнено(Остаток) Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Число(Значение);

КонецФункции

// Представление версии для журнала регистрации.
//
// Параметры:
//  Версия - Строка - версия; пустая строка означает новую базу
//
// Возвращаемое значение:
//  Строка - представление версии
//
Функция ВерсияПредставление(Версия)

	Если ЗначениеЗаполнено(Версия) Тогда
		Возврат Версия;
	КонецЕсли;

	Возврат НСтр("ru = '(новая база)'; fr = '(nouvelle base)'; en = '(new infobase)'; es = '(base nueva)'");

КонецФункции

// Записывает сообщение механизма обновления в журнал регистрации.
//
// Параметры:
//  Уровень   - УровеньЖурналаРегистрации - уровень записи
//  Сообщение - Строка                    - текст сообщения
//
Процедура ЗаписатьВЖурнал(Уровень, Сообщение)

	ЗаписьЖурналаРегистрации(ИмяСобытияЖурнала(), Уровень, , , Сообщение);

КонецПроцедуры

#КонецОбласти
